class Bankomat:
    def __init__(self, баланс):
        self.баланc = баланс

    def балансты_текшер(self):
        print(f"Сиздин балансыңыз: {self.баланc} сом")

    def акча_алу(self, сумма):
        if сумма > self.баланc:
            print("Кечиресиз, жетишпейт!")
        else:
            self.баланc -= сумма
            print(f"Сиз {сумма} сом алдыңыз.")
            self.балансты_текшер()

    def акча_кошуу(self, сумма):
        self.баланc += сумма
        print(f"Сиздин эсепке {сумма} сом кошулду.")
        self.балансты_текшер()

# Баштоо
my_bankomat = Bankomat(1000)  # Башкача айтканда, баланстын баштапкы суммасы 1000 сом

# Колдонуучу өзүнүн операцияларын жасай алат
my_bankomat.балансты_текшер()  # Баланс текшерүү
my_bankomat.акча_алу(200)  # 200 сом алуу
my_bankomat.акча_кошуу(500)  # 500 сом кошуу
my_bankomat.акча_алу(1500)  # Жетишпейт

